{
  "sections": {
    "1": {
      "title": "নামাজের গুরুত্ব ও তাৎপর্য",
      "content": "<div class=\"content-wrapper\"><h2>নামাজের গুরুত্ব ও তাৎপর্য</h2><p>ইসলামের পাঁচটি স্তম্ভের মধ্যে <strong class=\"correct-info\">নামাজ দ্বিতীয় স্থানে অবস্থিত</strong> এবং এটি ঈমানের পর সবচেয়ে গুরুত্বপূর্ণ ইবাদত। মহান আল্লাহ তায়ালা কোরআনুল কারীমে বহু আয়াতে নামাজের নির্দেশ দিয়েছেন এবং এর প্রতি যত্নবান হতে বলেছেন। নামাজ মানুষকে অশ্লীল ও মন্দ কাজ থেকে বিরত রাখে এবং আল্লাহর সাথে বান্দার সরাসরি সম্পর্ক স্থাপন করে।</p><h3>কুরআনের দলিল:</h3><blockquote>\"নিশ্চয়ই নামাজ মুমিনদের জন্য <strong class=\"correct-info\">নির্দিষ্ট সময়ে ফরজ</strong>।\" (সূরা নিসা: ১০৩)</blockquote><blockquote>\"তুমি তোমার প্রতিপালকের ইবাদত কর এবং তাঁর আনুগত্য কর।\" (সূরা দাহর: ৩৬) - <strong class=\"correct-info\">এই আয়াতটি মূলত আল্লাহর আনুগত্যের কথা বলে, সরাসরি নামাজের ফরজিয়াত নিয়ে সূরা বাকারার ১৫৩, ২২৩, ২৩৮, সূরা আনআমের ৭২, সূরা তাওবার ৭১, ১০৩ আয়াতগুলো বেশি প্রাসঙ্গিক।</strong></blockquote><blockquote>\"<strong class=\"correct-info\">আর নামাজ কায়েম করো এবং যাকাত দাও। আর যা কিছু কল্যাণ তোমরা নিজেদের জন্য অগ্রে পাঠাবে, তা আল্লাহর কাছে পাবে। নিশ্চয় আল্লাহ তোমাদের সমস্ত আমল দেখছেন।</strong>\" (সূরা বাকারা: ১১০)</blockquote><blockquote>\"<strong class=\"correct-info\">আমার বান্দাদের মধ্যে যারা ঈমান এনেছে তাদেরকে বলুন, যেন তারা নামাজ প্রতিষ্ঠা করে এবং আমার দেওয়া রিযিক থেকে প্রকাশ্যে ও গোপনে খরচ করে, সেই দিন আসার পূর্বে যেদিন কোনো বেচাকেনা বা বন্ধুত্ব থাকবে না।</strong>\" (সূরা ইব্রাহীম: ৩১)</blockquote><h3>হাদিসের দলিল:</h3><blockquote>\"<strong class=\"correct-info\">নামাজ ইসলামের স্তম্ভ। যে এটি রক্ষা করল, সে তার ধর্ম রক্ষা করল; আর যে এটি ত্যাগ করল, সে তার ধর্ম ধ্বংস করল।</strong>\" (মুসনাদে আহমদ) - <strong class=\"correct-info\">এই হাদিসটি কিছুটা দুর্বল সূত্রে বর্ণিত, তবে নামাজের গুরুত্ব অপরিসীম। সহীহ মুসলিমের একটি হাদিসে বলা হয়েছে, \"বান্দা ও শিরক ও কুফরের মাঝে পার্থক্য সৃষ্টিকারী হচ্ছে নামাজ ত্যাগ করা।\"</strong></blockquote><blockquote>\"<strong class=\"correct-info\">আব্দুল্লাহ ইবনে মাসউদ (রা) থেকে বর্ণিত: আমি রাসূলুল্লাহ (সা)-কে জিজ্ঞেস করলাম, কোন্ আমল আল্লাহর কাছে সর্বাধিক প্রিয়? তিনি বললেন, 'সময় মতো নামাজ আদায় করা।</strong>\" (সহীহ বুখারী ও মুসলিম)</blockquote><blockquote>\"<strong class=\"correct-info\">রাসূলুল্লাহ (সা) বলেছেন: তোমাদের কারো বাড়ির দরজার সামনে যদি একটি নদী থাকে আর সে তাতে প্রতিদিন পাঁচবার গোসল করে, তাহলে কি তার শরীরে কোনো ময়লা থাকবে? সাহাবারা বললেন, না, কোনো ময়লা থাকবে না। তিনি বললেন, পাঁচ ওয়াক্ত নামাজের দৃষ্টান্তও ঠিক তেমনই। এর মাধ্যমে আল্লাহ গুনাহসমূহ মুছে দেন।</strong>\" (সহীহ বুখারী ও মুসলিম)</blockquote><h3>নামাজের তাৎপর্য:</h3><ul><li><strong class=\"correct-info\">আল্লাহর সাথে সরাসরি সংযোগ স্থাপন:</strong> নামাজ মুমিনের জন্য আল্লাহর সান্নিধ্য লাভের এক অনন্য মাধ্যম। এটি মিরাজ স্বরূপ।</li><li><strong class=\"correct-info\">গুনাহ থেকে বিরত রাখে:</strong> \"নিশ্চয় নামাজ অশ্লীল ও মন্দ কাজ থেকে বিরত রাখে।\" (সূরা আনকাবুত: ৪৫)</li><li><strong class=\"correct-info\">দিনে ৫ বার আল্লাহর স্মরণে নিমগ্ন থাকার সুযোগ:</strong> এতে অন্তর পরিশুদ্ধ হয় এবং দুনিয়ার ব্যস্ততা সত্ত্বেও আল্লাহর স্মরণ থেকে বিচ্যুত হওয়া থেকে রক্ষা পাওয়া যায়।</li><li><strong class=\"correct-info\">কবরের প্রথম প্রশ্ন:</strong> কিয়ামতের দিন সর্বপ্রথম বান্দার নামাজের হিসাব নেওয়া হবে। যদি নামাজ ঠিক হয়, তবে অন্যান্য আমলও সহজ হবে।</li><li><strong class=\"correct-info\">শারীরিক ও মানসিক সুস্থতা:</strong> নামাজের নিয়মিত অনুশীলন শরীরকে সতেজ রাখে এবং মনকে প্রশান্তি দেয়।</li><li><strong class=\"correct-info\">সামাজিক ঐক্য:</strong> জামাতে নামাজ আদায় মুসলিমদের মধ্যে ভ্রাতৃত্ব ও ঐক্যের বন্ধন সুদৃঢ় করে।</li></ul></div>"
    },
    "2": {
      "title": "নামাজের পূর্বশর্ত",
      "content": "<div class=\"content-wrapper\"><h2>নামাজের পূর্বশর্ত</h2><p>নামাজ আদায়ের জন্য ৭টি শর্ত পূরণ করা আবশ্যক। এই শর্তগুলো পূরণ না হলে নামাজ আদায় সহীহ (বৈধ) হবে না।</p><h3>(ক) ইসলাম গ্রহণ:</h3><ul><li>অমুসলিমদের জন্য নামাজ ফরজ নয়। ইসলাম গ্রহণের পরই নামাজ ফরজ হয়।</li></ul><h3>(খ) বুদ্ধিমত্তা ও প্রাপ্তবয়স্কতা:</h3><ul><li>পাগল বা অপ্রাপ্তবয়স্ক (বালেগ না হওয়া) ব্যক্তির উপর নামাজ ফরজ নয়। তবে ৭ বছর বয়স থেকে শিশুদের নামাজের অভ্যাস করানো সুন্নাত।</li><li>নবী করিম (সা.) বলেছেন, \"<strong class=\"correct-info\">তোমাদের সন্তানদের সাত বছর বয়স থেকে নামাজ পড়তে আদেশ করো এবং দশ বছর বয়সে তাদের জন্য বিছানা আলাদা করে দাও।</strong>\" (আবু দাউদ)</li></ul><h3>(গ) নিয়ত (ইচ্ছা):</h3><ul><li>নামাজ আদায়ের জন্য অবশ্যই নিয়ত করতে হয়। নিয়ত হলো হৃদয়ে নামাজ আদায়ের ইচ্ছা করা।</li><li>নিয়ত হৃদয়ে করা হয়, মুখে বলার প্রয়োজন নেই।</li><li>যে নামাজ পড়তে ইচ্ছা করা হচ্ছে (ফরজ, ওয়াজিব, সুন্নত, নফল) এবং কোন ওয়াক্তের নামাজ তা হৃদয়ে নির্ধারণ করতে হয়।</li></ul><h3>(ঘ) পবিত্রতা (তাহারাহ):</h3><ul><li>শরীর, পোশাক এবং নামাজের স্থান পবিত্র হতে হবে।</li><li>অপবিত্রতা (নাজাসাত) থেকে পবিত্র থাকতে হবে।</li><li>অজু বা গোসল অবস্থায় থাকতে হবে।</li><li><strong class=\"correct-info\">কুরআনে উল্লেখ:</strong> \"হে মুমিনগণ! তোমরা যখন নামাজের জন্য দাঁড়াবে, তখন তোমাদের মুখমণ্ডল ও হাত কনুই পর্যন্ত ধৌত করে নাও।\" (সূরা মায়েদা: ৬)</li></ul><h3>(ঙ) সতর ঢাকা:</h3><ul><li>নামাজের সময় সতর (শরীরের যে অংশ ঢাকা ফরজ) ঢেকে নামাজ পড়তে হয়।</li><li><strong class=\"correct-info\">পুরুষের সতর:</strong> নাভি থেকে হাঁটু পর্যন্ত।</li><li><strong class=\"correct-info\">মহিলার সতর:</strong> সমস্ত শরীর, মুখমণ্ডল, হাতের কব্জি থেকে নিচের অংশ এবং পায়ের গোড়ালি থেকে নিচের অংশ ব্যতীত।</li></ul><h3>(চ) কিবলামুখী হওয়া:</h3><ul><li>নামাজ আদায়ের সময় কাবা শরিফের দিকে মুখ করে দাঁড়াতে হয়।</li><li>কিবলার দিক সম্পর্কে নিশ্চিত না থাকলে, অনুমান করে কিবলার দিকে মুখ করে নামাজ পড়া যাবে।</li><li><strong class=\"correct-info\">কুরআনে উল্লেখ:</strong> \"আমি তোমাকে এমন কিবলার দিকে ফিরিয়েছি যার দিকে সবাই মুখ ফিরায়।\" (সূরা বাকারা: ১৪৪)</li></ul><h3>(ছ) নির্দিষ্ট সময়ে নামাজ পড়া:</h3><ul><li>প্রত্যেক ওয়াক্ত নামাজের নির্দিষ্ট সময় আছে। ওই সময়ের মধ্যে নামাজ আদায় করতে হয়।</li><li>সময়ের আগে বা পরে ইচ্ছাকৃতভাবে নামাজ পড়লে তা আদায় হবে না।</li><li><strong class=\"correct-info\">কুরআনে উল্লেখ:</strong> \"নিশ্চয়ই নামাজ মুমিনদের জন্য নির্দিষ্ট সময়ে ফরজ।\" (সূরা নিসা: ১০৩)</li></ul><h3>পূর্বশর্ত না মানলে নামাজের হুকুম:</h3><p>যদি কোনো পূর্বশর্ত পূরণ না হয়, তাহলে নামাজ আদায় হবে না। যেমন:</p><ul><li>অজু ছাড়া নামাজ পড়লে নামাজ হবে না।</li><li>সতর খোলা রেখে নামাজ পড়লে নামাজ হবে না।</li><li>কিবলার বিপরীত দিকে মুখ করে নামাজ পড়লে নামাজ হবে না।</li><li>নামাজের সময় না হওয়ার আগে নামাজ পড়লে তা হবে না।</li></ul></div>"
    },
    "3": {
      "title": "নামাজের সময়সূচী",
      "content": "<div class=\"content-wrapper\"><h2>নামাজের সময়সূচী</h2><p>ইসলামে দৈনিক পাঁচ ওয়াক্ত নামাজ ফরজ। প্রত্যেক ওয়াক্ত নামাজের নির্দিষ্ট সময় আছে। আল্লাহ তায়ালা কুরআনে বলেন, \"নিশ্চয়ই নামাজ মুমিনদের জন্য নির্দিষ্ট সময়ে ফরজ।\" (সূরা নিসা: ১০৩)</p><h3>ফজরের নামাজের সময়:</h3><ul><li><strong class=\"correct-info\">শুরু:</strong> সুবহে সাদিক (ফজরের ভোর) উদয় হওয়ার সময় থেকে।</li><li><strong class=\"correct-info\">শেষ:</strong> সূর্যোদয়ের পূর্ব পর্যন্ত।</li><li><strong class=\"correct-info\">বৈশিষ্ট্য:</strong> ফজরের নামাজ দুই রাকাত ফরজ। এর আগে দুই রাকাত সুন্নত আছে।</li></ul><h3>যোহরের নামাজের সময়:</h3><ul><li><strong class=\"correct-info\">শুরু:</strong> সূর্য ঢলে যাওয়ার পর (যখন সূর্য মেরুদন্ডের ঠিক মাঝখানে অবস্থান করে)।</li><li><strong class=\"correct-info\">শেষ:</strong> বস্তুর ছায়া তার আসল আকারের দ্বিগুণ হওয়ার পূর্ব পর্যন্ত।</li><li><strong class=\"correct-info\">বৈশিষ্ট্য:</strong> যোহরের নামাজ চার রাকাত ফরজ। এর আগে চার রাকাত সুন্নত ও পরে দুই রাকাত সুন্নত আছে।</li></ul><h3>আসরের নামাজের সময়:</h3><ul><li><strong class=\"correct-info\">শুরু:</strong> যোহরের সময় শেষ হওয়ার পর (বস্তুর ছায়া তার আসল আকারের দ্বিগুণ হওয়ার পর)।</li><li><strong class=\"correct-info\">শেষ:</strong> সূর্যাস্তের পূর্ব পর্যন্ত।</li><li><strong class=\"correct-info\">বৈশিষ্ট্য:</strong> আসরের নামাজ চার রাকাত ফরজ। এর আগে চার রাকাত সুন্নত আছে।</li></ul><h3>মাগরিবের নামাজের সময়:</h3><ul><li><strong class=\"correct-info\">শুরু:</strong> সূর্যাস্তের পর।</li><li><strong class=\"correct-info\">শেষ:</strong> লালিমা অস্তমিত হওয়ার পূর্ব পর্যন্ত (আকাশে লাল আভা থাকা অবস্থা)।</li><li><strong class=\"correct-info\">বৈশিষ্ট্য:</strong> মাগরিবের নামাজ তিন রাকাত ফরজ। এর আগে কোনো সুন্নত নেই, পরে দুই রাকাত সুন্নত আছে।</li></ul><h3>এশার নামাজের সময়:</h3><ul><li><strong class=\"correct-info\">শুরু:</strong> মাগরিবের সময় শেষ হওয়ার পর (আকাশে লাল আভা অদৃশ্য হওয়ার পর)।</li><li><strong class=\"correct-info\">শেষ:</strong> ফজরের ভোর হওয়ার পূর্ব পর্যন্ত।</li><li><strong class=\"correct-info\">বৈশিষ্ট্য:</strong> এশার নামাজ চার রাকাত ফরজ। এর আগে চার রাকাত সুন্নত ও পরে দুই রাকাত সুন্নত আছে।</li></ul><h3>নামাজের সময় নির্ধারণের পদ্ধতি:</h3><ul><li><strong class=\"correct-info\">সূর্যের অবস্থান:</strong> সূর্যের অবস্থান অনুযায়ী নামাজের সময় নির্ধারিত হয়।</li><li><strong class=\"correct-info\">ছায়া:</strong> বস্তুর ছায়ার দৈর্ঘ্য অনুযায়ী যোহর ও আসরের সময় নির্ধারিত হয়।</li><li><strong class=\"correct-info\">আকাশের রং:</strong> আকাশের রং অনুযায়ী ফজর, মাগরিব ও এশার সময় নির্ধারিত হয়।</li></ul><h3>মাকরূহ সময়ে নামাজ:</h3><p>কিছু সময় আছে যখন নামাজ পড়া মাকরূহ (অপছন্দনীয়)। এই সময়গুলো হলো:</p><ul><li><strong class=\"correct-info\">সূর্যোদয়ের সময়:</strong> সূর্য উঠার সময় থেকে সূর্য সম্পূর্ণরূপে উঠা পর্যন্ত।</li><li><strong class=\"correct-info\">যোহরের মধ্যবর্তী সময়:</strong> যখন সূর্য মেরুদন্ডের ঠিক মাঝখানে অবস্থান করে।</li><li><strong class=\"correct-info\">সূর্যাস্তের সময়:</strong> সূর্য অস্ত যাওয়ার সময় থেকে সূর্য সম্পূর্ণরূপে অস্ত যাওয়া পর্যন্ত।</li><li><strong class=\"correct-info\">আসরের পরে:</strong> আসরের সময় শেষ হওয়ার পর থেকে সূর্যাস্ত পর্যন্ত।</li></ul><p>তবে কোনো ওয়াক্ত নামাজ যদি তার নির্ধারিত সময়ে পড়া না হয়ে যায়, তবে কাযা করার জন্য এই মাকরূহ সময়েও নামাজ পড়া যাবে।</p><h3>নামাজের সময় সংক্রান্ত হাদিস:</h3><blockquote>\"<strong class=\"correct-info\">জিবরাঈল (আ.) এসে রাসূলুল্লাহ (সা.)-কে দুই দিন নামাজের সময় শিক্ষা দিলেন। প্রথম দিন তিনি প্রতিটি ওয়াক্তের শুরুর সময়ে নামাজ আদায় করালেন এবং দ্বিতীয় দিন শেষের সময়ে নামাজ আদায় করালেন। তারপর বললেন, হে মুহাম্মদ! এই হলো নামাজের সময়। এই দুই সময়ের মধ্যেই তুমি তোমার উম্মতকে নামাজ আদায় করতে বল।</strong>\" (সহীহ বুখারী ও মুসলিম)</blockquote></div>"
    },
    "4": {
      "title": "নামাজের রুকন ও ওয়াজিব",
      "content": "<div class=\"content-wrapper\"><h2>নামাজের রুকন ও ওয়াজিব</h2><p>নামাজের কিছু অংশ আছে যেগুলো না থাকলে নামাজ হয় না, এগুলোকে বলা হয় রুকন (স্তম্ভ)। আবার কিছু অংশ আছে যেগুলো ছেড়ে দিলে নামাজ হয় কিন্তু তা সহীহ হয় না, এগুলোকে বলা হয় ওয়াজিব (অপরিহার্য)।</p><h3>নামাজের রুকন (স্তম্ভ):</h3><ol><li><strong class=\"correct-info\">কিয়াম (দাঁড়ানো):</strong> ফরজ নামাজে সক্ষম ব্যক্তির জন্য দাঁড়িয়ে নামাজ পড়া ফরজ। অসুস্থ ব্যক্তি বসে নামাজ পড়তে পারে।</li><li><strong class=\"correct-info\">কিরাত (কুরআন তেলাওয়াত):</strong> ফরজ নামাজের প্রথম দুই রাকাতে সূরা ফাতিহা ও অন্য একটি সূরা বা সূরার কিছু অংশ পড়া ফরজ।</li><li><strong class=\"correct-info\">রুকু (ঝুঁকে যাওয়া):</strong> প্রত্যেক রাকাতে রুকু করা ফরজ। রুকুতে কমপক্ষে একবার \"সুবহানা রাব্বিয়াল আযীম\" পড়তে হবে।</li><li><strong class=\"correct-info\">রুকু থেকে দাঁড়ানো:</strong> রুকু থেকে সোজা হয়ে দাঁড়ানো ফরজ।</li><li><strong class=\"correct-info\">সিজদা (সেজদা করা):</strong> প্রত্যেক রাকাতে দুইবার সিজদা করা ফরজ। সিজদায় কমপক্ষে একবার \"সুবহানা রাব্বিয়াল আ'লা\" পড়তে হবে।</li><li><strong class=\"correct-info\">সিজদা থেকে উঠে বসা:</strong> দুই সিজদার মাঝে বসা ফরজ।</li><li><strong class=\"correct-info\">শেষ বৈঠকে কমপক্ষে এক তাশাহুদ পড়া:</strong> শেষ বৈঠকে অন্তত এক তাশাহুদ পড়া ফরজ।</li><li><strong class=\"correct-info\">শেষ বৈঠকে দরুদ শরীফ পড়া:</strong> শেষ বৈঠকে দরুদ শরীফ পড়া ফরজ।</li><li><strong class=\"correct-info\">সালাম (সালাম ফিরানো):</strong> নামাজ শেষে কমপক্ষে একবার \"আসসালামু আলাইকুম ওয়া রাহমাতুল্লাহ\" বলে সালাম ফিরানো ফরজ।</li><li><strong class=\"correct-info\">তাকবীরে তাহরীমা (আল্লাহু আকবার বলে নামাজ শুরু করা):</strong> নামাজ শুরু করার সময় \"আল্লাহু আকবার\" বলা ফরজ।</li><li><strong class=\"correct-info\">তাকদীর (সঠিক ক্রম অনুসরণ করা):</strong> নামাজের রুকনগুলো সঠিক ক্রম অনুসারে পড়া ফরজ।</li><li><strong class=\"correct-info\">আরাম (শান্তি ও ধীরস্থিরতা):</strong> নামাজের প্রতিটি অঙ্গভঙ্গি শান্তিতে ও ধীরস্থিরভাবে সম্পন্ন করা ফরজ।</li><li><strong class=\"correct-info\">মুয়ালাত (ধারাবাহিকতা):</strong> নামাজের রুকনগুলো একের পর এক ছাড়া না করে পড়া ফরজ।</li></ol><h3>নামাজের ওয়াজিব (অপরিহার্য):</h3><ol><li><strong class=\"correct-info\">প্রত্যেক রাকাতে সূরা ফাতিহা পড়া:</strong> ফরজ নামাজের প্রত্যেক রাকাতে সূরা ফাতিহা পড়া ওয়াজিব।</li><li><strong class=\"correct-info\">সূরা ফাতিহার সাথে অন্য সূরা যোগ করা:</strong> ফরজ নামাজের প্রথম দুই রাকাতে সূরা ফাতিহার সাথে অন্য একটি সূরা বা সূরার কিছু অংশ পড়া ওয়াজিব।</li><li><strong class=\"correct-info\">প্রথম রাকাতের পর দ্বিতীয় রাকাতে সূরা ফাতিহার পূর্বে তাসবীহ (সুবহানাল্লাহ) পড়া:</strong> প্রথম রাকাতের পর দ্বিতীয় রাকাতে সূরা ফাতিহার পূর্বে তাসবীহ পড়া ওয়াজিব।</li><li><strong class=\"correct-info\">রুকু ও সিজদার তাসবীহ পড়া:</strong> রুকু ও সিজদায় কমপক্ষে একবার তাসবীহ পড়া ওয়াজিব।</li><li><strong class=\"correct-info\">সিজদার সময় সাতটি অঙ্গ মাটিতে রাখা:</strong> সিজদার সময় কপাল, নাক, দুই হাত, দুই হাঁটু ও দুই পায়ের আঙ্গুলের গোড়ালি মাটিতে রাখা ওয়াজিব।</li><li><strong class=\"correct-info\">কিয়াম ও কুরান তেলাওয়াতের মধ্যে তাকবীর (আল্লাহু আকবার) বলা:</strong> কিয়াম থেকে রুকুতে যাওয়ার সময় \"আল্লাহু আকবার\" বলা ওয়াজিব।</li><li><strong class=\"correct-info\">রুকু থেকে কিয়ামে ফিরে আসার সময় \"সামিআল্লাহু লিমান হামিদাহ\" বলা:</strong> রুকু থেকে উঠে দাঁড়ানোর সময় \"সামিআল্লাহু লিমান হামিদাহ\" বলা ওয়াজিব।</li><li><strong class=\"correct-info\">কিয়াম থেকে সিজদায় যাওয়ার সময় তাকবীর (আল্লাহু আকবার) বলা:</strong> কিয়াম থেকে সিজদায় যাওয়ার সময় \"আল্লাহু আকবার\" বলা ওয়াজিব।</li><li><strong class=\"correct-info\">দুই সিজদার মাঝে বসার সময় \"রাব্বিগফিরলী\" বলা:</strong> দুই সিজদার মাঝে বসার সময় \"রাব্বিগফিরলী\" বলা ওয়াজিব।</li><li><strong class=\"correct-info\">সকল অবস্থায় কিবলার দিকে মুখ করে থাকা:</strong> নামাজের সময় সকল অবস্থায় কিবলার দিকে মুখ করে থাকা ওয়াজিব।</li><li><strong class=\"correct-info\">ইমামের পিছনে নামাজ পড়লে ইমামের কথা শোনা:</strong> ইমামের পিছনে নামাজ পড়লে ইমামের কথা শোনা ওয়াজিব।</li><li><strong class=\"correct-info\">ইমামের পিছনে নামাজ পড়লে ইমামের সাথে মিল না রাখা:</strong> ইমামের পিছনে নামাজ পড়লে ইমামের সাথে মিল না রেখে তার পিছনে থেকে নামাজ পড়া ওয়াজিব।</li><li><strong class=\"correct-info\">তিন বা চার রাকাত ওয়ালা নামাজে প্রথম দুই রাকাতের পর তাশাহুদ পড়া:</strong> তিন বা চার রাকাত ওয়ালা নামাজে প্রথম দুই রাকাতের পর তাশাহুদ পড়া ওয়াজিব।</li></ol><h3>রুকন ও ওয়াজিব ছেড়ে দেওয়ার হুকুম:</h3><ul><li><strong class=\"correct-info\">রুকন ছেড়ে দেওয়া:</strong> কোনো রুকন ইচ্ছাকৃতভাবে বা ভুলবশত ছেড়ে দিলে নামাজ হবে না। নামাজ আবার পড়তে হবে।</li><li><strong class=\"correct-info\">ওয়াজিব ইচ্ছাকৃতভাবে ছেড়ে দেওয়া:</strong> কোনো ওয়াজিব ইচ্ছাকৃতভাবে ছেড়ে দিলে নামাজ হবে না। নামাজ আবার পড়তে হবে।</li><li><strong class=\"correct-info\">ওয়াজিব ভুলবশত ছেড়ে দেওয়া:</strong> কোনো ওয়াজিব ভুলবশত ছেড়ে দিলে সাহু সিজদা করে নামাজ শুদ্ধ করতে হবে।</li></ul><h3>সাহু সিজদা:</h3><ul><li><strong class=\"correct-info\">সাহু সিজদা করার কারণ:</strong> নামাজের কোনো ওয়াজিব ভুলবশত ছেড়ে দেওয়া হলে সাহু সিজদা করতে হয়।</li><li><strong class=\"correct-info\">সাহু সিজদা করার পদ্ধতি:</strong> নামাজ শেষে সালাম ফিরানোর আগে দুই সিজদা করে সাহু সিজদা করতে হয়।</li><li><strong class=\"correct-info\">সাহু সিজদার তাসবীহ:</strong> সাহু সিজদায় \"সুবহানা মান লা ইয়ানামু ওয়া লা ইয়াসাহু\" পড়তে হয়।</li></ul></div>"
    },
    "5": {
      "title": "নামাজের পদ্ধতি (ধাপে ধাপে)",
      "content": "<div class=\"content-wrapper\"><h2>নামাজের পদ্ধতি (ধাপে ধাপে)</h2><p>নামাজ পড়ার সঠিক পদ্ধতি জানা প্রত্যেক মুসলিমের জন্য অত্যন্ত গুরুত্বপূর্ণ। নিচে চার রাকাত ফরজ নামাজের ধাপে ধাপে পদ্ধতি উল্লেখ করা হলো:</p><h3>প্রথম রাকাত:</h3><ol><li><strong class=\"correct-info\">নিয়ত করা:</strong> হৃদয়ে নিয়ত করতে হবে যে, আমি এই ওয়াক্তের ফরজ নামাজ পড়ছি।</li><li><strong class=\"correct-info\">তাকবীরে তাহরীমা:</strong> হাত কান পর্যন্ত উঠিয়ে \"আল্লাহু আকবার\" বলে নামাজ শুরু করতে হবে।</li><li><strong class=\"correct-info\">সানা পড়া:</strong> তারপর নিচের দোয়া পড়তে হবে: \"সুবহানাকাল্লাহুম্মা ওয়া বিহামদিকা ওয়া তাবারাকাসমুকা ওয়া তা'আলা জাদ্দুকা ওয়া লা ইলাহা গাইরুক।\"</li><li><strong class=\"correct-info\">আউযুবিল্লাহ ও বিসমিল্লাহ পড়া:</strong> \"আ'উযু বিল্লাহি মিনাশ শাইতানির রাজীম। বিসমিল্লাহির রাহমানির রাহীম।\"</li><li><strong class=\"correct-info\">সূরা ফাতিহা পড়া:</strong> সূরা ফাতিহা সম্পূর্ণ পড়তে হবে।</li><li><strong class=\"correct-info\">অন্য সূরা পড়া:</strong> সূরা ফাতিহার পর কোনো একটি সূরা বা সূরার কিছু অংশ পড়তে হবে।</li><li><strong class=\"correct-info\">রুকু করা:</strong> \"আল্লাহু আকবার\" বলে রুকুতে যেতে হবে। রুকুতে কমপক্ষে তিনবার \"সুবহানা রাব্বিয়াল আযীম\" পড়তে হবে।</li><li><strong class=\"correct-info\">রুকু থেকে উঠা:</strong> \"সামিআল্লাহু লিমান হামিদাহ\" বলে রুকু থেকে উঠে দাঁড়াতে হবে। দাঁড়িয়ে \"রাব্বানা লাকাল হামদ\" বলতে হবে।</li><li><strong class=\"correct-info\">প্রথম সিজদা:</strong> \"আল্লাহু আকবার\" বলে প্রথম সিজদায় যেতে হবে। সিজদায় কমপক্ষে তিনবার \"সুবহানা রাব্বিয়াল আ'লা\" পড়তে হবে।</li><li><strong class=\"correct-info\">সিজদা থেকে উঠে বসা:</strong> \"আল্লাহু আকবার\" বলে সিজদা থেকে উঠে বসতে হবে। বসার সময় \"রাব্বিগফিরলী\" বলতে হবে।</li><li><strong class=\"correct-info\">দ্বিতীয় সিজদা:</strong> \"আল্লাহু আকবার\" বলে দ্বিতীয় সিজদায় যেতে হবে। সিজদায় কমপক্ষে তিনবার \"সুবহানা রাব্বিয়াল আ'লা\" পড়তে হবে।</li><li><strong class=\"correct-info\">দ্বিতীয় রাকাতে উঠা:</strong> \"আল্লাহু আকবার\" বলে দ্বিতীয় রাকাতে উঠতে হবে।</li></ol><h3>দ্বিতীয় রাকাত:</h3><ol><li><strong class=\"correct-info\">সূরা ফাতিহা পড়া:</strong> দ্বিতীয় রাকাতে সূরা ফাতিহা সম্পূর্ণ পড়তে হবে।</li><li><strong class=\"correct-info\">অন্য সূরা পড়া:</strong> সূরা ফাতিহার পর কোনো একটি সূরা বা সূরার কিছু অংশ পড়তে হবে।</li><li><strong class=\"correct-info\">রুকু করা:</strong> \"আল্লাহু আকবার\" বলে রুকুতে যেতে হবে। রুকুতে কমপক্ষে তিনবার \"সুবহানা রাব্বিয়াল আযীম\" পড়তে হবে।</li><li><strong class=\"correct-info\">রুকু থেকে উঠা:</strong> \"সামিআল্লাহু লিমান হামিদাহ\" বলে রুকু থেকে উঠে দাঁড়াতে হবে। দাঁড়িয়ে \"রাব্বানা লাকাল হামদ\" বলতে হবে।</li><li><strong class=\"correct-info\">প্রথম সিজদা:</strong> \"আল্লাহু আকবার\" বলে প্রথম সিজদায় যেতে হবে। সিজদায় কমপক্ষে তিনবার \"সুবহানা রাব্বিয়াল আ'লা\" পড়তে হবে।</li><li><strong class=\"correct-info\">সিজদা থেকে উঠে বসা:</strong> \"আল্লাহু আকবার\" বলে সিজদা থেকে উঠে বসতে হবে। বসার সময় \"রাব্বিগফিরলী\" বলতে হবে।</li><li><strong class=\"correct-info\">দ্বিতীয় সিজদা:</strong> \"আল্লাহু আকবার\" বলে দ্বিতীয় সিজদায় যেতে হবে। সিজদায় কমপক্ষে তিনবার \"সুবহানা রাব্বিয়াল আ'লা\" পড়তে হবে।</li><li><strong class=\"correct-info\">তাশাহুদে বসা:</strong> \"আল্লাহু আকবার\" বলে সিজদা থেকে উঠে তাশাহুদের জন্য বসতে হবে।</li><li><strong class=\"correct-info\">তাশাহুদ পড়া:</strong> তাশাহুদ পড়তে হবে: \"আত্তাহিয়াতু লিল্লাহি ওয়াস সালাওয়াতু ওয়াত তায়িবাতু। আসসালামু আলাইকা আইয়্যুহান্নাবিয়্যু ওয়া রাহমাতুল্লাহি ওয়া বারাকাতুহ। আসসালামু আলাইনা ওয়া আলা ইবাদিল্লাহিস সালিহীন। আশহাদু আল্লা ইলাহা ইল্লাল্লাহু ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রাসূলুহু।\"</li><li><strong class=\"correct-info\">দরুদ শরীফ পড়া:</strong> তাশাহুদের পর দরুদ শরীফ পড়তে হবে: \"আল্লাহুম্মা সাল্লি আলা মুহাম্মাদিন ওয়া আলা আলি মুহাম্মাদ। কামা সাল্লাইতা আলা ইব্রাহীমা ওয়া আলা আলি ইব্রাহীম। ইন্নাকা হামীদুম মাজীদ। আল্লাহুম্মা বারিক আলা মুহাম্মাদিন ওয়া আলা আলি মুহাম্মাদ। কামা বারাকতা আলা ইব্রাহীমা ওয়া আলা আলি ইব্রাহীম। ইন্নাকা হামীদুম মাজীদ।\"</li><li><strong class=\"correct-info\">তৃতীয় রাকাতে উঠা:</strong> \"আল্লাহু আকবার\" বলে তৃতীয় রাকাতে উঠতে হবে।</li></ol><h3>তৃতীয় রাকাত:</h3><ol><li><strong class=\"correct-info\">সূরা ফাতিহা পড়া:</strong> তৃতীয় রাকাতে সূরা ফাতিহা সম্পূর্ণ পড়তে হবে।</li><li><strong class=\"correct-info\">রুকু করা:</strong> \"আল্লাহু আকবার\" বলে রুকুতে যেতে হবে। রুকুতে কমপক্ষে তিনবার \"সুবহানা রাব্বিয়াল আযীম\" পড়তে হবে।</li><li><strong class=\"correct-info\">রুকু থেকে উঠা:</strong> \"সামিআল্লাহু লিমান হামিদাহ\" বলে রুকু থেকে উঠে দাঁড়াতে হবে। দাঁড়িয়ে \"রাব্বানা লাকাল হামদ\" বলতে হবে।</li><li><strong class=\"correct-info\">প্রথম সিজদা:</strong> \"আল্লাহু আকবার\" বলে প্রথম সিজদায় যেতে হবে। সিজদায় কমপক্ষে তিনবার \"সুবহানা 
